<template>
    <h1>{{ the.title }}</h1>
    <p>{{ the.description }}</p>
    <el-divider></el-divider>
    <dl class="grid grid-cols-2 gap-x-4 w-fit not-prose">
        <dt class="font-bold text-right">Адрес репозитория:</dt>
        <dd><a href="https://github.com/jbruwes/telegram-form-cloudflare-worker" target="_blank"
                class="underline">https://github.com/jbruwes/telegram-form-cloudflare-worker</a></dd>
        <dt class="font-bold text-right">Стек технологий:</dt>
        <dd>cloudflare worker, telegram bot api</dd>
        <dt class="font-bold text-right">Решаемая задача:</dt>
        <dd>Создание формы обратной связи, которая отправляет данные в телеграмм канал</dd>
    </dl>
    <p>Многие до сих пор используют формы обратной связи, отправляющие данные на электронную почту. Однако это не всегда
        удобно - нужно постоянно проверять почту, чтобы не пропустить важные сообщения. В этом проекте я реализовал
        форму обратной связи, которая отправляет данные напрямую в Telegram-чат. Это гораздо удобнее, так как можно
        настроить мгновенные уведомления и не нужно постоянно проверять почту.</p>
    <p>Для реализации серверной части я использовал Cloudflare Workers. Это решение позволяет создать серверную логику
        на JavaScript без необходимости развертывания собственного сервера. Cloudflare Workers предоставляют возможность
        развернуть серверные функции прямо в инфраструктуре Cloudflare. Это удобно, так как не требует оплаты за хостинг
        и позволяет быстро развернуть серверную часть.</p>
    <p>Основные преимущества:</p>
    <ul>
        <li>Мгновенные уведомления в Telegram</li>
        <li>Нет необходимости постоянно проверять почту</li>
        <li>Бесплатное решение без собственного сервера</li>
        <li>Быстрое развертывание и масштабирование</li>
    </ul>
    <p>Этот подход делает обработку обращений от пользователей более оперативной и удобной.</p>
    <p>В процессе работы над проектом, я столкнулся с необходимостью локализации на русский язык ошибок сервера. Нашел
        проект, который реализует этот функционал @http-util/status-i18n, но не поддерживал русский язык. Решил добавить
        поддержку русского языка и отправил pull request. Теперь проект @http-util/status-i18n поддерживает русский язык
        и может быть
        использован для локализации ошибок сервера.</p>
</template>

<script setup lang="js">
import { inject } from 'vue';

const { pid } = defineProps(["pid"]),
    the = inject("pages")[pid]

</script>
